# Denison CS181/DA210 Homework 2.a - Step 1

Before you turn this problem in, make sure everything runs as expected. This is a combination of **restarting the kernel** and then **running all cells** (in the menubar, select Kernel$\rightarrow$Restart And Run All).

Make sure you fill in any place that says `# YOUR CODE HERE` or "YOUR ANSWER HERE".

---

In [1]:
import pandas as pd

---

## Part A: Tidy Data requirements

**Def. 6.1** A data set in the tabular data model is said to be _tidy data_ if it conforms to the following.

1. Each column represents _exactly one variable_ of the data set.  ("TidyData1")
2. Each row represents _exactly one unique (relational) mapping_, that maps from a set of _givens_ (the values of the independent variables) to the values of the depedent variables.  ("TidyData2")
3. _Exactly one table_ is used for each set of mappings involving the same independent variables.  ("TidyData3")

---

**Q1:** Consider the following dataset, represented by `table1`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy.

No because observations under the country-year column contain more than exactly one piece of information

In [2]:
table1columns = [  "country-year",       "type",   "count"]
table1data =[ ["Afghanistan-1999",      "cases",       745],
              ["Afghanistan-1999", "population",  19987071],
              ["Afghanistan-2000",      "cases",      2666],
              ["Afghanistan-2000", "population",  20595360],
              [     "Brazil-1999",      "cases",     37737],
              [     "Brazil-1999", "population", 172006362],
              [     "Brazil-2000",      "cases",     80488],
              [     "Brazil-2000", "population", 174504898],
              [      "China-1999",      "cases",    212258],
              [      "China-1999", "population",1272915272],
              [      "China-2000",      "cases",    213766],
              [      "China-2000", "population",1280428583] ]
table1 = pd.DataFrame(table1data, columns=table1columns)
table1

        country-year        type       count
0   Afghanistan-1999       cases         745
1   Afghanistan-1999  population    19987071
2   Afghanistan-2000       cases        2666
3   Afghanistan-2000  population    20595360
4        Brazil-1999       cases       37737
5        Brazil-1999  population   172006362
6        Brazil-2000       cases       80488
7        Brazil-2000  population   174504898
8         China-1999       cases      212258
9         China-1999  population  1272915272
10        China-2000       cases      213766
11        China-2000  population  1280428583

---

**Q2:** Consider the following dataset, represented by `table2`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy.

No because the "type" column represents more than one variable (cases and population)

In [3]:
table2columns = ["country",  "year",       "type",     "count"]
table2data =[ ["Afghanistan",  1999,      "cases",       745],
              ["Afghanistan",  1999, "population",  19987071],
              ["Afghanistan",  2000,      "cases",      2666],
              ["Afghanistan",  2000, "population",  20595360],
              [     "Brazil",  1999,      "cases",     37737],
              [     "Brazil",  1999, "population", 172006362],
              [     "Brazil",  2000,      "cases",     80488],
              [     "Brazil",  2000, "population", 174504898],
              [      "China",  1999,      "cases",    212258],
              [      "China",  1999, "population",1272915272],
              [      "China",  2000,      "cases",    213766],
              [      "China",  2000, "population",1280428583] ]

table2 = pd.DataFrame(table2data, columns=table2columns)
table2

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

---

**Q3:** Consider the following dataset, represented by `table3cases` and `table3pop`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy.

No because there is more than 1 table used to represent mapping of the same independent variable (country)

In [4]:
table3casescolumns = ["country", "1999", "2000"]
table3casesdata = [ ["Afghanistan",    745,   2666],
                [     "Brazil",  37737,  80488],
                [      "China", 212258, 213766] ]

table3cases = pd.DataFrame(table3casesdata, columns=table3casescolumns)
table3cases

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

In [5]:
table3popcolumns = ["country", "1999", "2000"]
table3popdata = [ ["Afghanistan",   19987071,   20595360],
                [      "China", 1272915272, 1280428583],
                [     "Brazil",  172006362,  174504898]]
table3pop = pd.DataFrame(table3popdata, columns=table3popcolumns)
table3pop

       country        1999        2000
0  Afghanistan    19987071    20595360
1        China  1272915272  1280428583
2       Brazil   172006362   174504898

---

**Q4:** Consider the following dataset, represented by `table4cases` and `table4pop`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy.

No because there is more than 1 table used to represent mapping of the same independent variable (country)

In [6]:
table4acolumns = ["country", "year", "cases"]
table4adata = [ ["Afghanistan",  1999,    745],
                ["Afghanistan",  2000,   2666],
                [     "Brazil",  1999,  37737],
                [     "Brazil",  2000,  80488],
                [      "China",  1999, 212258],
                [      "China",  2000, 213766] ]

table4bcolumns = ["country", "year", "population"]
table4bdata =[ ["Afghanistan",  1999,   19987071],
               ["Afghanistan",  2000,   20595360],
               [     "Brazil",  1999,  172006362],
               [     "Brazil",  2000,  174504898],
               [      "China",  1999, 1272915272],
               [      "China",  2000, 1280428583] ]
table4cases = pd.DataFrame(table4adata, columns=table4acolumns)
table4pop = pd.DataFrame(table4bdata, columns=table4bcolumns)

In [7]:
table4cases

       country  year   cases
0  Afghanistan  1999     745
1  Afghanistan  2000    2666
2       Brazil  1999   37737
3       Brazil  2000   80488
4        China  1999  212258
5        China  2000  213766

In [8]:
table4pop

       country  year  population
0  Afghanistan  1999    19987071
1  Afghanistan  2000    20595360
2       Brazil  1999   172006362
3       Brazil  2000   174504898
4        China  1999  1272915272
5        China  2000  1280428583

---

## Part B

**Q5:** For the dataset considered in this assignment, what are the independent variables?  What are the depedent variables?

Indepedent variables: country, year
Dependent variables: cases, population

---

---
## Part C

How much time (in minutes/hours) did you spend on this homework assignment?

20 minutes